
//                     task1,task2,task3,task4


//     2.Գրել ծրագիր որ լատինատառ տեքստը որևէ մոտավորուchunckթյամբ կսարքի հայատառ: Օրինակ ա տառը կդառնա a:Այդպես բոլոր տառերը: Ստեղծել readStream և highWaterMark:1  նշելով բոլոր սիմվոլների վրայով անցնել:
//     Ծրագիրը աշխատացնել homework4Eng.txt համար:
//
//     3.Ստեղծել RemoveSpecialChars կլաս, որը ժառանգում է
//     Transform կլասին: _transform մեթոդը վերասահմանել այնպես, որ իր միջով անցնող տեքստից հեռացնել հատուկ սիմվոլները:
//
//     Կլասից ստեղծել օբեկտ: homeworkr5.txt պարունակությունը pipe անել օբեկտով և պահապանել homeworkw5.txt ֆայլում:
//
//     4.Ստեղծել Promise վերադարձնող ֆունկցիա որը ստանում
//     է տեքստ ֆայլի հասցե և տեքստի բառերի առաջին տառերը սաքում մեծատառ․